// ================================================================
// ФАЙЛ: src/route/index.js
// Тут ми лише приймаємо запити і віддаємо сторінки
// ================================================================

// Підключення технології express для back-end сервера
const express = require('express');
const router = express.Router();

// ПІДКЛЮЧЕННЯ "БАЗИ ДАНИХ" (деструктуризація об'єкта)
const {
  flexCards,
  flex2Plans,
  flex3Widgets,
  flex4Cards,
  mediaTestProduct,
  media1Movies,
  techStore1Products,
  techStore2Products,
} = require('../data/data'); // Шлях до нового файлу

// ================================================================
// РОУТИ (МАРШРУТИ)
// ================================================================

// Заглушка для Chrome DevTools, щоб не смітив у термінал помилками 404
router.get('/.well-known/appspecific/com.chrome.devtools.json', (req, res) =>
  res.status(204).end(),
);

// ================================================================
// ======================== INDEX ========================
// ================================================================
router.get('/', function (req, res) {
  res.render('pages/index', {});
});

// ================================================================
// ======================== FLEX ========================
// ================================================================
router.get('/flex', function (req, res) {
  res.render('pages/flex', { style: 'flex', cards: flexCards });
});

// ================================================================
// ======================== FLEX-2 ========================
// ================================================================
router.get('/flex-2', function (req, res) {
  res.render('pages/flex-2', { style: 'flex-2', plans: flex2Plans });
});

// ================================================================
// ======================== FLEX-3 ========================
// ================================================================
router.get('/flex-3', function (req, res) {
  res.render('pages/flex-3', { style: 'flex-3', widgets: flex3Widgets });
});

// ================================================================
// ======================== FLEX-4 ========================
// ================================================================
router.get('/flex-4', function (req, res) {
  res.render('pages/flex-4', {
    style: 'flex-4',
    title: 'Media Dashboard',
    cards: flex4Cards,
  });
});

// ================================================================
// ======================== FLEX-5 ========================
// ================================================================
router.get('/flex-5', (req, res) => {
  res.render('pages/flex-5', { style: 'flex-5', title: 'flex box Test' });
});

// ================================================================
// ======================== GYM ========================
// ================================================================
router.get('/gym', function (req, res) {
  res.render('pages/gym', { style: 'gym' });
});

// ================================================================
// ======================== BOX ========================
// ================================================================
router.get('/box', (req, res) => {
  res.render('pages/box', { style: 'box', title: 'Box Model Test' });
});

// ================================================================
// ======================== BOX-2 ========================
// ================================================================
router.get('/box-2', (req, res) => {
  res.render('pages/box-2', { style: 'box-2', title: 'Box Model Test' });
});

// ================================================================
// ======================== MEDIA-test ========================
// ================================================================
router.get('/media-test', (req, res) => {
  res.render('pages/media-test', {
    style: 'media-test',
    product: mediaTestProduct,
  });
});

// ================================================================
// ======================== MEDIA-1 ========================
// ================================================================
router.get('/media-1', (req, res) => {
  res.render('pages/media-1', { style: 'media-1', movies: media1Movies });
});

// ================================================================
// ======================== HEADER-test ========================
// ================================================================
router.get('/header-test', (req, res) => {
  res.render('pages/header-test', { style: 'header-test' });
});

// ================================================================
// ======================== TECH-STORE-1 ========================
// ================================================================
router.get('/tech-store-1', function (req, res) {
  res.render('pages/tech-store-1', {
    style: 'tech-store-1',
    products: techStore1Products,
  });
});

// ================================================================
// ======================== TECH-STORE-2 ========================
// ================================================================
router.get('/tech-store-2', function (req, res) {
  res.render('pages/tech-store-2', {
    style: 'tech-store-2',
    products: techStore2Products,
  });
});

// ================================================================
// ======================== GRID-TEST ========================
// ================================================================
router.get('/grid-test', function (req, res) {
  res.render('pages/grid-test', { style: 'grid-test' });
});

// ================================================================
// ======================== GRID-1 ========================
// ================================================================
router.get('/grid-1', function (req, res) {
  res.render('pages/grid-1', { style: 'grid-1' });
});

// ================================================================
// ======================== GRID-FLEX ========================
// ================================================================
router.get('/grid-flex', function (req, res) {
  res.render('pages/grid-flex', { style: 'grid-flex' });
});

// ================================================================

// Підключення роутера до бек-енду
module.exports = router;
